int/resources/objectRepo/xmlTemplates/opera/ProfileMembership/req_CreateMembershipClaim.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v9="http://micros/opera/ws/crm/v9_00" xmlns:v91="http://micros/opera/ws/common/v9_00">
   <soapenv:Header/>
   <soapenv:Body>
      <v9:CreateMembershipClaimRQ CorrelationID="?" EchoToken="?" Enforce="?" RequestCount="?" TimeStamp="?" Version="?">
         <v91:OperaContext>
            <v91:UserLanguage/>
            <v91:CROCode/>
            <v91:HotelCode/>
            <v91:Language/>
            <v91:RunningApplication/>
            <v91:TerminalId/>
            <v91:LogLevel/>
            <v91:ExternalSystem/>
            <v91:Override/>
            <v91:TargetExternalSystem/>
            <v91:UseLocal/>
            <v91:ExternalData/>
         </v91:OperaContext>
         <v9:MembershipClaimDetails>
            <v91:ClaimNo ID="?" IDExtension="?" ID_Context="?" Instance="?" Type="?" URL="?"/>
            <v91:ClaimDate/>
            <v91:CloseDate/>
            <v91:Source/>
            <v91:CallerName/>
            <v91:Owner/>
            <v91:ClaimStatus/>
            <v91:ClaimType/>
            <v91:Origin/>
            <v91:CallerInformation/>
            <v91:ReplyBy/>
            <v91:Comments/>
            <v91:ApprovalStatus/>
            <v91:RecordType/>
            <v91:ProfileID ID="?" IDExtension="?" ID_Context="?" Instance="?" Type="?" URL="?"/>
            <v91:Membership EffectiveDate="?" ExpireDate="?" ExpireDateExclusiveIndicator="?" MembershipID="?" MembershipIDNo="?" MembershipLevel="?" ProgramID="?">
               <v91:NameOnCard/>
               <v91:MembershipClass/>
            </v91:Membership>
            <v91:Reservation>
               <v91:HotelCode/>
               <v91:ConfirmationNo>
                  <v91:UniqueID ID="?" IDExtension="?" ID_Context="?" Instance="?" Type="?" URL="?"/>
               </v91:ConfirmationNo>
               <v91:Arrival/>
               <v91:Departure/>
            </v91:Reservation>
            <v91:ClaimPoints>
               <v91:AdjustmentCode/>
               <v91:TotalBasePointsLimits/>
               <v91:BaseStayLimits/>
               <v91:BaseNightsLimits/>
               <v91:BaseRevenueLimits/>
               <v91:AwardBasePoints/>
               <v91:AwardBonusPoints/>
               <v91:AwardMiscPoints/>
               <v91:AwardTotalPoints/>
               <v91:TierBaseStayPoints/>
               <v91:TierBonusStayPoints/>
               <v91:TierTotalStayPoints/>
               <v91:TierBaseNightsPoints/>
               <v91:TierBonusNightsPoints/>
               <v91:TierTotalNightsPoints/>
               <v91:TierBaseRevenuePoints/>
               <v91:TierBonusRevenuePoints/>
               <v91:TierTotalRevenuePoints/>
            </v91:ClaimPoints>
            <v91:ActivityLog>
               <v91:ClaimActivity CreateDateTime="?" CreatorID="?" LastModifierID="?" LastModifyDateTime="?" PurgeDate="?">
                  <v91:Sequence/>
                  <v91:Type/>
                  <v91:Comments/>
               </v91:ClaimActivity>
            </v91:ActivityLog>
            <v91:Submitter/>
         </v9:MembershipClaimDetails>
      </v9:CreateMembershipClaimRQ>
   </soapenv:Body>
</soapenv:Envelope>